---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.AreaBasedLoadData
source: html/f471ab8c-ad32-b819-fa42-64d16296b70f.htm
---
# AreaBasedLoadData Methods

Adds electrical load area into the area based load.